In [3]:
import pandas as pd
import numpy as np

In [ ]:
#query()

In [5]:
df=pd.DataFrame(np.random.rand(10,3), columns=['a','b','c'])
df

          a         b         c
0  0.839295  0.333157  0.080528
1  0.562419  0.181882  0.839330
2  0.496881  0.880658  0.744685
3  0.106148  0.639968  0.144756
4  0.478482  0.990943  0.057273
5  0.059928  0.982324  0.269434
6  0.337507  0.680072  0.611824
7  0.475699  0.929503  0.848990
8  0.710217  0.031666  0.671532
9  0.183044  0.771489  0.507691

In [13]:
#b is the largest
df[(df['a']<df['b']) & (df['b']>df['c'])]
#(df['a']<df['b']) & (df['b']>df['c'])
##most simplest method

          a         b         c
2  0.496881  0.880658  0.744685
3  0.106148  0.639968  0.144756
4  0.478482  0.990943  0.057273
5  0.059928  0.982324  0.269434
6  0.337507  0.680072  0.611824
7  0.475699  0.929503  0.848990
9  0.183044  0.771489  0.507691

In [11]:
df['b']>0.5

0    False
1    False
2     True
3     True
4     True
5     True
6     True
7     True
8    False
9     True
Name: b, dtype: bool

In [14]:
df.query('(a<b) & (b>c)')

          a         b         c
2  0.496881  0.880658  0.744685
3  0.106148  0.639968  0.144756
4  0.478482  0.990943  0.057273
5  0.059928  0.982324  0.269434
6  0.337507  0.680072  0.611824
7  0.475699  0.929503  0.848990
9  0.183044  0.771489  0.507691

In [15]:
df[(df['a']>df['c']) & (df['b']>df['c']) ]

          a         b         c
0  0.839295  0.333157  0.080528
4  0.478482  0.990943  0.057273

In [17]:
df[(df['a']>df['b']) | (df['a']>df['c'])]

          a         b         c
0  0.839295  0.333157  0.080528
1  0.562419  0.181882  0.839330
4  0.478482  0.990943  0.057273
8  0.710217  0.031666  0.671532

In [18]:
df.query('(a>b) | (a>c)')

          a         b         c
0  0.839295  0.333157  0.080528
1  0.562419  0.181882  0.839330
4  0.478482  0.990943  0.057273
8  0.710217  0.031666  0.671532

In [19]:
#pd.to_datetime()   we convert strings to date and time
my_var="22/12/2020"
type(my_var)

str

In [27]:
dates_dataframe=pd.DataFrame({'date':["22/12/2020","23/12/2000","3/11/2000","3/12/2000"]})
print(dates_dataframe)
dates_dataframe2=pd.DataFrame(["22/12/2020","23/12/2000","3/11/2000","3/12/2000"],columns=["date"])
dates_dataframe2

         date
0  22/12/2020
1  23/12/2000
2   3/11/2000
3   3/12/2000

         date
0  22/12/2020
1  23/12/2000
2   3/11/2000
3   3/12/2000

In [29]:
dataframe_dates=pd.to_datetime(dates_dataframe2['date'])
dataframe_dates

0   2020-12-22
1   2000-12-23
2   2000-03-11
3   2000-03-12
Name: date, dtype: datetime64[ns]

In [30]:
type(dates_dataframe2)

pandas.core.frame.DataFrame

In [32]:
type(dataframe_dates)

pandas.core.series.Series

In [47]:
dataframe_dates2=pd.to_datetime(dates_dataframe2["date"], dayfirst=True)
dataframe_dates2
#####

0   2020-12-22
1   2000-12-23
2   2000-11-03
3   2000-12-03
Name: date, dtype: datetime64[ns]

In [49]:
dates_dataframe3=pd.DataFrame(["22/12/2020","23/12/2000","3/11/2000","z/12/2000"],columns=["date"])
dates_dataframe3

         date
0  22/12/2020
1  23/12/2000
2   3/11/2000
3   z/12/2000

In [51]:
#dataframe_dates3=pd.to_datetime(dates_dataframe3["date"])
dataframe_dates3=pd.to_datetime(dates_dataframe3["date"], errors='ignore')
dataframe_dates3

0    22/12/2020
1    23/12/2000
2     3/11/2000
3     z/12/2000
Name: date, dtype: object

In [55]:
birthdays=pd.DataFrame({'name':["Ayush","Divya","Vinayak"], 'DOB':["22/12/2020","23/12/2000","3/11/2000"]})
birthdays=pd.to_datetime(birthdays["DOB"])
birthdays

0   2020-12-22
1   2000-12-23
2   2000-03-11
Name: DOB, dtype: datetime64[ns]

In [57]:
birthdays.dt.year

0    2020
1    2000
2    2000
Name: DOB, dtype: int64

In [58]:
birthdays.dt.month

0    12
1    12
2     3
Name: DOB, dtype: int64

In [60]:
birthdays.dt.day

0    22
1    23
2    11
Name: DOB, dtype: int64

In [61]:
birthdays.dt.week

<ipython-input-61-503f13f6f21c>:1: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated.  Please use Series.dt.isocalendar().week instead.
  birthdays.dt.week

0    52
1    51
2    10
Name: DOB, dtype: int64

In [62]:
birthdays.dt.dayofweek

0    1
1    5
2    5
Name: DOB, dtype: int64

In [63]:
birthdays.dt.is_leap_year

0    True
1    True
2    True
Name: DOB, dtype: bool

In [66]:
today=pd.to_datetime('today')
today.year - birthdays.dt.year

0     1
1    21
2    21
Name: DOB, dtype: int64